# 음료수 얼려 먹기 문제

# N x M 크기의 얼음 틀이 있다. 구멍이 뚫린 부분은 0, 막힌 부분은 1이다.
# 구멍이 뚫려 있는 부분끼리 상,하,좌,우로 붙어 있는 경우에
# 서로 연결되어 있다고 간주한다.
# 얼음 틀의 모양이 주어졌을 때 생성되는 총 아이스크림의 개수를 구하라.

# > 0끼리 모여서 1개의 아이스크림이 된다.

# 00110
# 00011
# 11111
# 00000     > 3개의 아이스크림 생성 

# 입력 조건 
# 첫 번째 줄에 얼음 틀의 세로 길이 N과 가로 길이 M이 주어진다.(1 <= N, M <= 1000)

# 4 5
# 00110
# 00011
# 11111
# 00000     

# 출력 예시
# 3

########################### 
# 풀이

# N, M을 공백을 기준으로 구분하여 입력 받기
n, m = map(int,input().split())     # 4, 5

# 2차원 리스트의 맵 정보 입력 받기
graph = []
for i in range(n):
    graph.append(list(map(int,input())))

# DFS로 특정 노드를 방문하고 연결된 모든 노드들도 방문
def dfs(x, y):
    # 주어진 범위를 벗어나는 경우에는 즉시 종료
    if x <= -1 or x >= n or y <= -1 or y >= m:
        return False
    # 현재 노드를 아직 방문하지 않았다면?
    if graph[x][y] == 0:
        # 해당 노드를 방문 처리
        graph[x][y] = 1
        # 상, 하, 좌, 우 모두 재귀적으로 호출
        dfs(x - 1, y)   # 상
        dfs(x, y - 1)   # 좌 
        dfs(x + 1, y)   # 하
        dfs(x, y + 1)   # 우
        return True
    return False





# 모든 노드(위치)에 대하여 음료수 채우기
result = 0
for i in range(n):
    for j in range(m):
        # 현재 위치에서 DFS 수행
        if dfs(i, j) == True:
            result += 1


print(result)



